/*
 * Eid-Hermes eBPF-based PCIe Accelerator
 * Copyright (c) 2020 Eidetic Communications Inc.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 */

#include "qemu/osdep.h"
#include "qemu/units.h"
#include "hw/pci/pci.h"
#include "hw/pci/msix.h"
#include "qapi/error.h"
#include "trace.h"

#define TYPE_PCI_HERMES_DEVICE "hermes"
#define HERMES(obj)       OBJECT_CHECK(HermesState, obj, TYPE_PCI_HERMES_DEVICE)

#define HERMES_BAR0_SIZE          (32 * MiB)
#define HERMES_BAR2_SIZE          (64 * KiB)
#define HERMES_BAR4_SIZE          (128 * MiB)

#define HERMES_EHVER_OFF     0x00
#define HERMES_EHTS_OFF      0x04
#define HERMES_EHENG_OFF     0x08
#define HERMES_EHPSLOT_OFF   0x09
#define HERMES_EHDSLOT_OFF   0x0A
#define HERMES_EHPSOFF_OFF   0x0C
#define HERMES_EHPSSZE_OFF   0x10
#define HERMES_EHDSOFF_OFF   0x14
#define HERMES_EHDSSZE_OFF   0x18

#define HERMES_EHVER_VAL     1
#define HERMES_EHTS_VAL      1602198883
#define HERMES_EHENG_VAL     1
#define HERMES_EHPSLOT_VAL   16
#define HERMES_EHDSLOT_VAL   32
#define HERMES_EHPSSZE_VAL   (1 * MiB)
#define HERMES_EHDSSZE_VAL   (1 * MiB)
#define HERMES_EHPSOFF_VAL   0
#define HERMES_EHDSOFF_VAL   (HERMES_EHPSSZE_VAL * HERMES_EHPSLOT_VAL)

#define HERMES_MSIX_VEC_NUM      32
#define HERMES_MSIX_TABLE_OFFSET (0x8000)
#define HERMES_MSIX_PBA_OFFSET   (0x8FE0)

#define W1S(old, new) ((old) | (new))
#define W1C(old, new) ((old) & ~(new))

QEMU_BUILD_BUG_MSG(HERMES_EHDSSZE_VAL * HERMES_EHDSLOT_VAL +
                   HERMES_EHPSSZE_VAL * HERMES_EHPSLOT_VAL > HERMES_BAR4_SIZE,
                   "Hermes: BAR4 is too small, it won't fit all program and data slots");

typedef struct HermesState HermesState;

struct hermes_bar0 {
    uint32_t ehver;
    uint32_t ehts;

    uint8_t eheng;
    uint8_t ehpslot;
    uint8_t ehdslot;
    uint8_t rsv0;

    uint32_t ehdsoff;
    uint32_t ehdssze;
    uint32_t ehpsoff;
    uint32_t ehpssze;

    MemoryRegion mem_reg;
};

struct hermes_bar2_engine_reg {
    uint32_t identifier;         /* 0x00 */
    uint32_t control;            /* 0x04, 0x08 and 0x0C */
    uint32_t status;             /* 0x40 and 0x44 */
    uint32_t cmp_desc_count;     /* 0x48 */
    uint32_t alignment;          /* 0x4C */
    uint32_t wb_addr_low;        /* 0x88 */
    uint32_t wb_addr_high;       /* 0x8C */
    uint32_t inter_enable_mask;  /* 0x90, 0x94 and 0x98 */
    uint32_t pmc;                /* 0xC0 */
    uint32_t pcc0;               /* 0xC4 */
    uint32_t pcc1;               /* 0xC4 */
    uint32_t pdc0;               /* 0xCC */
    uint32_t pdc1;               /* 0xD0 */
};

struct hermes_bar2_irq_reg {
    uint32_t identifier;              /* 0x00 */
    uint32_t user_inter_enable_mask;  /* 0x04, 0x08 and 0x0C */
    uint32_t chnl_inter_enable_mask;  /* 0x10, 0x14 and 0x18 */
    uint32_t user_inter_request;      /* 0x40 */
    uint32_t chnl_inter_request;      /* 0x44 */
    uint32_t user_inter_pending;      /* 0x48 */
    uint32_t chnl_inter_pending;      /* 0x4C */
    uint32_t user_vct_num0;           /* 0x80 */
    uint32_t user_vct_num1;           /* 0x84 */
    uint32_t user_vct_num2;           /* 0x88 */
    uint32_t user_vct_num3;           /* 0x8C */
    uint32_t chnl_vct_num0;           /* 0xA0 */
    uint32_t chnl_vct_num1;           /* 0xA4 */
};

struct hermes_bar2_cfg_reg {
    uint32_t identifier;          /* 0x00 */
    uint32_t busdev;              /* 0x04 */
    uint32_t pcie_mpl;            /* 0x08 */
    uint32_t pcie_mrrs;           /* 0x0C */
    uint32_t sysid;               /* 0x10 */
    uint32_t msi_enable;          /* 0x14 */
    uint32_t pcie_data_w;         /* 0x18 */
    uint32_t pcie_ctrl;           /* 0x1C */
    uint32_t axi_usr_mpl;         /* 0x40 */
    uint32_t axi_usr_mrrs;        /* 0x44 */
    uint32_t write_flush_timeout; /* 0x60 */
};

struct hermes_bar2_sgdma_reg {
    uint32_t identifier;     /* 0x00 */
    uint32_t desc_low_addr;  /* 0x80 */
    uint32_t desc_high_addr; /* 0x84 */
    uint32_t desc_num_adj;   /* 0x88 */
    uint32_t desc_credits;   /* 0x8C */
};

struct hermes_bar2_sgdma_common_reg {
    uint32_t identifier;              /* 0x00 */
    uint32_t desc_ctrl;               /* 0x10, 0x14 and 0x18 */
    uint32_t desc_credit_mode_enable; /* 0x20, 0x24 and 0x28 */
};

struct hermes_bar2_msix_pba_reg {
    uint32_t vec0_addr_low;   /* 0x00 */
    uint32_t vec0_addr_high;  /* 0x04 */
    uint32_t vec0_data;       /* 0x08 */
    uint32_t vec0_ctrl;       /* 0x0C */
    uint32_t vec31_addr_low;  /* 0x1F0 */
    uint32_t vec31_addr_high; /* 0x1F4 */
    uint32_t vec31_data;      /* 0x1F8 */
    uint32_t vec31_ctrl;      /* 0x1FC */
    uint32_t pba;             /* 0xFE0 */
};

struct hermes_bar2 {
    struct hermes_bar2_engine_reg h2c;
    struct hermes_bar2_engine_reg c2h;
    struct hermes_bar2_irq_reg irq;
    struct hermes_bar2_cfg_reg cfg;
    struct hermes_bar2_sgdma_reg h2c_sgdma;
    struct hermes_bar2_sgdma_reg c2h_sgdma;
    struct hermes_bar2_sgdma_common_reg sgdma_common;
    struct hermes_bar2_msix_pba_reg msix_pba;

    MemoryRegion mem_reg;
    HermesState *parent;
};

struct hermes_bar4 {
    MemoryRegion mem_reg;
};

struct hermes_dma_desc {
    uint32_t ctrl;
    uint32_t len;
    uint32_t src_addr_lo;
    uint32_t src_addr_hi;
    uint32_t dst_addr_lo;
    uint32_t dst_addr_hi;
    uint32_t nxt_addr_lo;
    uint32_t nxt_addr_hi;
};

struct HermesState {
    PCIDevice pdev;
    struct hermes_bar0 *bar0;
    struct hermes_bar2 *bar2;
    struct hermes_bar4 *bar4;
};

static uint64_t hermes_bar0_read(void *opaque, hwaddr addr, unsigned size)
{
    HermesState *hermes = opaque;
    uint32_t *ptr;
