/*
 * Hermes eBPF-based PCIe Accelerator
 * Copyright (c) 2020 Eidetic Communications Inc.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 */

#include "qemu-version.h"
#include "qemu/osdep.h"
#include "qemu/error-report.h"
#include "qemu/units.h"
#include "hw/pci/pci.h"
#include "hw/pci/msix.h"
#include "qapi/error.h"
#include "trace.h"
#include <ubpf.h>
#include <elf.h>

#define TYPE_PCI_HERMES_DEVICE "hermes"
#define HERMES(obj)       OBJECT_CHECK(HermesState, obj, TYPE_PCI_HERMES_DEVICE)

#define HERMES_BAR0_SIZE          (32 * MiB)
#define HERMES_BAR2_SIZE          (64 * KiB)

#define H2C_CHANNELS              4
#define C2H_CHANNELS              4

#define UBPF_ENGINES              4

/*
 * We use the XDMA IP for interrupts. For details, see:
 * https://github.com/aws/aws-fpga/tree/master/sdk/linux_kernel_drivers/xdma
 * https://www.xilinx.com/support/documentation/ip_documentation/xdma/v4_1/pg195-pcie-dma.pdf
 */
#define HERMES_MSIX_VEC_NUM       32
#define HERMES_MSIX_TABLE_OFFSET  0x8000
#define HERMES_MSIX_PBA_OFFSET    0x8FE0

/*
 * See Xilinx PG195 for more details on these enums and defines
 *
 * For configurable numbers, we match what is used on AWS F1
 */

#define HERMES_ID_CORE              (0x1FC << 20)
#define HERMES_ID_H2C_CHNL          (0x0   << 16)
#define HERMES_ID_C2H_CHNL          (0x1   << 16)
#define HERMES_ID_IRQ               (0x2   << 16)
#define HERMES_ID_CFG               (0x3   << 16)
#define HERMES_ID_H2CSG             (0x4   << 16)
#define HERMES_ID_C2HSG             (0x5   << 16)
#define HERMES_ID_VER_20164         0x05
#define HERMES_CHNL_ALIGN_ADDR      (1 << 16)
#define HERMES_CHNL_ALIGN_LEN_GRAN  (1 << 8)
#define HERMES_CHNL_ALIGN_ADDR_BITS (1 << 6)

#define W1S(old, new) ((old) | (new))
#define W1C(old, new) ((old) & ~(new))

#define HERMES_CMD_STOP           0x0
#define HERMES_CMD_START          0x1
#define HERMES_CMD_NOT_FINISHED   0x0
#define HERMES_CMD_FINISHED       0x1

#define HERMES_OPCODE_REQUEST_SLOT 0x00
#define HERMES_OPCODE_RELEASE_SLOT 0x01
#define HERMES_OPCODE_EXECUTE_SLOT 0x80

#define HERMES_STATUS_SUCCESS           0x00
#define HERMES_STATUS_OUT_OF_SPACE      0x01
#define HERMES_STATUS_INVALID_PROG_SLOT 0x02
#define HERMES_STATUS_INVALID_DATA_SLOT 0x03
#define HERMES_STATUS_INVALID_ADDR      0x04
#define HERMES_STATUS_EBPF_ERROR        0x05
#define HERMES_STATUS_INVALID_OPCODE    0x06

#define HERMES_BAR0_CMD_REQ    0x1000
#define HERMES_BAR0_CMD_CTRL   0x2000

typedef struct HermesState HermesState;

struct __attribute__((__packed__)) hermes_cmd_req {
    uint8_t opcode;
    uint8_t rsv0;
    uint16_t cid;
    uint32_t rsv1;

    uint8_t prog_slot;
    uint8_t data_slot;
    uint16_t rsv2;
    uint32_t prog_len;

    uint8_t rsv3[16];
};

struct __attribute__((__packed__)) hermes_cmd_res {
    uint16_t cid;
    uint8_t status;
    uint8_t rsv[5];

    uint64_t ebpf_ret;
};

struct __attribute__((__packed__)) hermes_cmd
{
    struct hermes_cmd_req req;
    struct hermes_cmd_res res;
};

struct __attribute__((__packed__)) hermes_cmd_ctrl {
    uint8_t ehcmdexec;
    uint8_t ehcmddone;
    uint8_t rsv[6];
};

static struct hermes_bar0 {
    const uint32_t ehver;
    const char ehbld[48];

    const uint8_t eheng;
    const uint8_t ehpslot;
    const uint8_t ehdslot;
    const uint8_t rsv0;

    const uint32_t ehpsoff;
    const uint32_t ehpssze;
    const uint32_t ehdsoff;
    const uint32_t ehdssze;

    struct hermes_cmd commands[UBPF_ENGINES];
    struct hermes_cmd_ctrl cmdctrl[UBPF_ENGINES];
} bar0_init = {
    .ehver =  1,
    .ehbld = QEMU_PKGVERSION,
    .eheng = UBPF_ENGINES,
    .ehpslot = 16,
    .ehdslot = 16,
    .ehpsoff = 0,
    .ehpssze = 1 * MiB,
    .ehdsoff = 16 * MiB, /* must be >= ehpslot * ehpssze */
    .ehdssze = 1 * MiB,
};

/*
 * BAR2 is used to do DMA using the xdma driver
 * (https://github.com/aws/aws-fpga/tree/master/sdk/linux_kernel_drivers/xdma)
 *
 * The specification of BAR 2 can be found on the following document (Tables
 * 35-126):
 * https://www.xilinx.com/support/documentation/ip_documentation/xdma/v4_1/pg195-pcie-dma.pdf
 * (note that in this document it uses BAR1, but here and on AWS we use BAR2)
 *
 * Note that we currently do not support all registers, only those that were
 * actually used by the XDMA driver.
 */
struct hermes_bar2_engine_reg {
    uint32_t identifier;              /* 0x00 */
    uint32_t control;                 /* 0x04, 0x08 and 0x0C */
    uint32_t status;                  /* 0x40 and 0x44 */
    uint32_t cmp_desc_count;          /* 0x48 */
    uint32_t alignment;               /* 0x4C */
    uint32_t inter_enable_mask;       /* 0x90, 0x94 and 0x98 */
};

struct hermes_bar2_irq_reg {
    uint32_t identifier;              /* 0x00 */
    uint32_t user_inter_enable_mask;  /* 0x04, 0x08 and 0x0C */
    uint32_t chnl_inter_enable_mask;  /* 0x10, 0x14 and 0x18 */
    uint32_t user_inter_request;      /* 0x40 */
    uint32_t chnl_inter_request;      /* 0x44 */
    uint32_t user_inter_pending;      /* 0x48 */
    uint32_t chnl_inter_pending;      /* 0x4C */
    uint32_t user_vct_num[4];         /* 0x80 -- 0x8C */
    uint32_t chnl_vct_num[2];         /* 0xA0 -- 0xA4 */
};

struct hermes_bar2_cfg_reg {
    uint32_t identifier;              /* 0x00 */
};

struct hermes_bar2_sgdma_reg {
    hwaddr desc_addr;                 /* 0x80 - 0x84 */
    uint32_t desc_num_adj;            /* 0x88 */
};

struct hermes_bar2_dir_reg {
    struct hermes_bar2_engine_reg channel;
    struct hermes_bar2_sgdma_reg sgdma;
    void (*perform_dma)(HermesState *hermes, hwaddr src_addr, hwaddr dst_addr,
                        dma_addr_t len);
    int irq_vector;
    void *(*entry)(void*);
    char name[16];
    int ch;
    QemuCond dma_cond;
    QemuMutex dma_mutex;
    QemuThread dma_thread;
};

struct hermes_bar2 {
    struct hermes_bar2_dir_reg h2c[H2C_CHANNELS];
    struct hermes_bar2_dir_reg c2h[C2H_CHANNELS];
    struct hermes_bar2_irq_reg irq;
    struct hermes_bar2_cfg_reg cfg;
};

struct hermes_ubpf_eng {
    struct ubpf_vm *engine;
    QemuCond bpf_cond;
    QemuMutex bpf_mutex;
    QemuThread bpf_thread;

    int no;
    char name[16];
};

struct HermesState {
    PCIDevice pdev;
    MemoryRegion bar0_mem_reg;
    MemoryRegion bar2_mem_reg;
    MemoryRegion bar4_mem_reg;

    struct hermes_bar2 bar2;

    bool stopping;

